vegeta-cli/src/vegeta/aeromant/templates/rotor_mrf_installed/com/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    sides
    {
        type            slip;
    }
    "(body|static).*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
