vegeta-cli/src/vegeta/aeromant/templates/rotor_mrf_installed/com/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              {{KINEMATIC_VISCOSITY}};

// ************************************************************************* //
